"""字符串
- 特点
  - 有序
  - 不可变
  - 可迭代
- 索引(语法与列表相同)
- 切片(语法与列表相同)
- in 操作符(语法与列表相同)
- 方法
  - find(sub): 查找子字符串在字符串中的第一个出现位置的索引(如果不存在, 返回-1)。
  - count(sub): 统计子字符串在字符串中出现的次数。
  - upper(): 将字符串中的所有字符转换为大写。
  - lower(): 将字符串中的所有字符转换为小写。
  - split(sep): 以指定的分隔符将字符串分割成多个子字符串。
  - strip(): 移除字符串首尾的空格。
  - replace(old, new): 用新字符串替换旧字符串。(所有匹配的子字符串都会被替换)
  - startswith(sub): 检查字符串是否以指定的子字符串开头。
  - endswith(sub): 检查字符串是否以指定的子字符串结尾。
"""

""" ------------------------ 定义方式 ------------------------ """
def f1():
    # 单引号
    s1 = 'hello world'
    print(s1)
    # 双引号
    s2 = "hello world"
    print(s2)
    # 多行字符串
    s3 = """
    hello world
    """
    print(s3)

# f1()

""" ------------------------ 转义字符 ------------------------ """
"""
- \' 单引号
- \" 双引号
- \\ 反斜杠
- \n 换行
- \t 水平制表符 (表示一个 tab 制表符的宽度)
"""
def f2():
    # 转义字符
    s2 = "hello\nworld"
    print('\\n', s2)
    # 转义字符
    s3 = "hello\\nworld"
    print('\\n', s3)
    # 转义字符
    s4 = "hello\tworld"
    print('\\t', s4)
    # 转义字符
    s6 = "hello\"world"
    print('\\"', s6)
    # 转义字符
    s7 = "hello\'world"
    print("\\'", s7)

# f2()

""" ------------------------ 字符串拼接 ------------------------ """
"""
- +号只能进行字符串之间的拼接, 非字符串需要先转成字符串
- str() 函数可以将其他类型的变量转换为字符串
"""

def f3():
    # 直接拼接
    s1 = "hello" "world" "!"
    print(s1)
    # 加号拼接
    s2 = "hello" + "world"
    print(s2)
    # 加号拼接, 非字符串需要先转成字符串
    s3 = "hello" + str(123)
    print(s3)
# f3()

""" ------------------------ 字符串拼接-占位符 ------------------------ """
"""
- 通过 %s 的形式完成字符串和变量的拼接
  - % 表示我要占位
  - s 表示将变量转为字符串放入占位的位置
- 非字符串会被自动转换为字符串
"""

def f4():
    # 单个变量
    s1 = "hello %s" % "world"
    print(s1)
    # 多个变量
    s2 = "hello %s, %s" % ("world", "python")
    print(s2)
# f4()

""" ------------------------ 字符串拼接-f(推荐) ------------------------ """
"""
- 通过 f"内容{变量/表达式}" 完成字符串和变量的拼接
"""

def f5():
    s1 = f"hello {'world'}"
    print(s1)
    s2 = f"hello {'world'},{123}"
    print(s2)
f5()

