"""list
- 索引
  - 正向索引: 从左到右，索引从 0 开始。
  - 反向索引: 从右到左，索引从 -1 开始。
- 修改
  - 直接通过索引修改元素值(如果索引不存在, 会直接报错)
- 删除元素
  - delete list[index]
- 切片
  - list[start:end:step]
    - start: 切片开始位置的索引(包含)(默认为0可省略, 后面的冒号不可省略)
    - end: 切片结束位置的索引(不包含)
    - step: 切片步长(默认值为 1)(默认为1可省略, 前面的冒号可省略)
- in 操作符
  - 用于检查元素是否存在于列表中。
- 解包
  - *list: 将列表解包为多个变量。
- 列表推导式
  - [要插入的元素 for 变量 in 可迭代对象 [if 条件]]
- 方法
  - append(元素): 在列表末尾添加一个元素。
  - remove(元素): 删除第一个匹配的元素。
  - insert(index, 元素): 在指定索引位置插入元素。
  - pop(index): 删除并返回指定索引位置的元素(如果不指定索引, 默认删除最后一个元素)。
  - sort(): 对列表进行排序(默认升序)。
  - reverse(): 反转列表元素的顺序。
"""

""" ------------------------ 类型 ------------------------ """
def f1():
  list = [1, 2, 3, 4, 5]
  print('类型', type(list)) # <class 'list'>
# f1()

""" ------------------------ 切片 ------------------------ """
def f2():
  list = [1, 2, 3, 4, 5]
  print(list[:3:]) # [1, 2, 3]
  print(list[:3]) # [1, 2, 3]
# f2()

""" ------------------------ in ------------------------ """
def f3():
  list = [1, 2, 3, 4, 5]
  print(2 in list) # True
  print(5 not in list) # False
  print(6 in list) # False
# f3()

""" ------------------------ 解包 ------------------------ """
def f4():
  list1 = [1, 2, 3, 4, 5]
  list2 = [6, 7, 8, 9, 10]
  print([*list1, *list2]) # 1 2 3 4 5 6 7 8 9 10
# f4()

""" ------------------------ 合并列表 ------------------------ """
def f5():
  list1 = [1, 2, 3, 4, 5]
  list2 = [6, 7, 8, 9, 10]
  print(list1 + list2) # 1 2 3 4 5 6 7 8 9 10
# f5()

""" ------------------------ 列表推导式 ------------------------ """
def f6():
  list = [1, 2, 3, 4, 5]
  print([x * 2 for x in list]) # [2, 4, 6, 8, 10]

  print([x * 2 for x in range(1, 6)]) # [2, 4, 6, 8, 10]

  print([x * 2 for x in list if x % 2 == 0]) # [4, 8] 

f6()

