"""set
- 特点
  - 无序
  - 不可重复
  - 可修改
- in 操作符
  - 用于检查元素是否存在于集合中。
- 解包(与列表相同)
- 实例方法
  - add(添加元素)
  - remove(删除元素)
  - discard(删除元素)
  - pop(删除并返回随机元素)
  - clear(清空集合)
  - difference(返回差集) => s1.difference(s2) 包含s1但不包含s2的元素
    - 使用差集符号：- => s1 - s2
    - 几何推导式: {x for x in s1 if x not in s2}
  - union(返回并集) => s1.union(s2) 包含s1和s2的所有元素
    - 使用并集符号：| => s1 | s2
  - intersection(返回交集) => s1.intersection(s2) 包含s1和s2的公共元素S
    - 使用交集符号：& => s1 & s2
"""

""" ------------------------ 基础 ------------------------ """
def f1():
  s1 = {1, 2, 3, 4, 5}
  print('类型', type(s1)) # <class 'set'> 

  # 定义空集合
  s2 = set()
  print('空集合', s2) # set()
  
# f1()

""" ------------------------ 几何推导式求差集 ------------------------ """
def f2():
  s1 = {1, 2, 3, 4, 5}
  s2 = {3, 4, 5, 6, 7}
  print('差集', {x for x in s1 if x not in s2}) # {1, 2}
# f2()

""" ------------------------ 解包 ------------------------ """
def f3():
  s1 = {1, 2, 3, 4, 5}
  s2 = {3, 4, 5, 6, 7}
  print('解包', [*s1, *s2]) # [1, 2, 3, 4, 5, 3, 4, 5, 6, 7]
f3()

