"""tuple
- 特点
  - 有序
  - 不可变
  - 可迭代
- 索引(与列表相同)
- 切片(与列表相同)
- 组包
- 解包
- 实例方法
  - index(与列表相同)
  - count(与列表相同)
"""

""" ------------------------ 类型 ------------------------ """
def f1():
  t1 = (1, 2, 3, 4, 5)
  print('类型', type(t1)) # <class 'tuple'> 
f1()

""" ------------------------ 定义单个元素的元组, 注意：单个元素的元组需要在元素后面添加逗号 ------------------------ """
def f2():
  t1 = (1)
  print(t1, type(t1)) # (1, <class 'int'>)
  
  t2 = (1,)
  print(t2, type(t2)) # (1,) <class 'tuple'>
# f2()

""" ------------------------ 组包 ------------------------ """
def f3():
  t1 = (1, 2, 3, 4, 5)
  print('t1', t1) # (1, 2, 3, 4, 5)
  t2 = 2, 3, 4, 5
  print('t2', t2) # (2, 3, 4, 5)
# f3()

""" ------------------------ 解包 ------------------------ """
def f4():
  # 基础解包
  t1 = (1, 2, 3, 4, 5)
  a, b, c, d, e = t1
  print('a', a) # 1 
  print('b', b) # 2
  print('c', c) # 3
  print('d', d) # 4
  print('e', e) # 5

  # 扩展解包
  x, *y, z = t1 
  print('x', x) # 1
  print('y', y) # [2, 3, 4]
  print('z', z) # 5

# f4()

""" ------------------------ 拓展用法-变量交换 ------------------------ """
def f5():
  a, b = 1, 2
  a, b = b, a
  print('a', a) # 2
  print('b', b) # 1
f5()
