"""函数
- 定义
  - def 函数名(参数1, 参数2, ...):
    函数体
    return 返回值
- 调用
  - 函数名(参数1, 参数2, ...)
- 函数的说明文档
  - help(函数名): 查看函数的说明文档
- global
  - global 变量名: 声明变量为全局变量
- 传参方式
  - 位置参数
    - 适合参数数量较少(一般不超过3个)
  - 关键字参数
    - 适合参数数量较多(一般超过3个)且容易混淆
  - 位置参数+关键字参数: 位置参数必须在关键字参数之前
- 默认参数
  - 定义时为参数指定默认值
  - 默认参数必须在位置参数之后
- 不定长参数
  - 定义时在参数名前添加 * 或 **
  - *args: 接收任意数量的位置参数，将其转换为元组
  - **kwargs: 接收任意数量的关键字参数，将其转换为字典
- 匿名函数
  - 表达式只能是单行
  - lambda 参数(可选): 表达式(返回值)
  - 调用: 函数名(参数1, 参数2, ...)
"""

""" ------------------------ 函数的说明文档 ------------------------ """


def circle_area_len(r):
    """
    根据圆的半径计算圆的周长
    :param r: 圆的半径
    :return: 圆的周长
    """
    return 2 * 3.14 * r


# circle_area_len(5)

""" ------------------------ 3.13 函数变量作用域 ------------------------ """

num = 10


def f1():

    num = 100
    print("f1-num1:", num)  # 100


# f1()
# print("global-num:", num)  # 10


def f2():
    # 表示要在函数中使用全局变量 num
    global num
    num = 100
    print("f2-num:", num)  # 100


# f2()

# print("global-num:", num)  # 100


""" ------------------------ 传参方式 ------------------------ """


def f3(r, pi):
    return pi * r**2


# # 位置参数
# print(f3(5, 3.14))  # 78.5
# # 关键字参数
# print(f3(pi=3.14, r=5))  # 78.5
# # 位置参数+关键字参数
# print(f3(5, pi=3.14))  # 78.5

""" ------------------------ 默认参数 ------------------------ """


def f4(r, pi=3.14):
    return pi * r**2


# print(f4(5))  # 78.5

""" ------------------------ 不定长参数(位置参数、关键字参数) ------------------------ """


def f5(*args, **kwargs):
    print(args)  # (1, 2, 3)
    print(kwargs)  # {'a': 1, 'b': 2, 'c': 3}


# f5(1, 2, 3, a=1, b=2, c=3)


""" ------------------------ 匿名函数 ------------------------ """


def f6(*args, **kwargs):
    # 参数+返回值
    sum = lambda x, y: x + y
    print(sum(1, 2))  # 3
    # 参数+表达式
    test1 = lambda msg: print(f"---{msg}---")
    test1("hello world")  # ---hello world---
    # 无参数+表达式
    test2 = lambda: print(123)
    test2()  # 123


f6()
