"""循环
- while
  - while(条件): 当条件为 True 时，执行循环体。
- for 元素 in 待处理数据集
- range
  - range(结束值): 生成从 0 到结束值（不包含结束值）的整数序列。
  - range(开始值, 结束值): 生成从开始值到结束值（不包含结束值）的整数序列。
  - range(开始值, 结束值, 步长): 生成从开始值到结束值（不包含结束值）的整数序列，步长为指定值。
- break
  - 用于跳出当前循环，继续执行循环后面的代码。
  - while 后面 else 的代码不会执行s
- continue
  - 用于跳过当前循环的剩余代码，直接进入下一次循环。
"""

""" ------------------------ while 基础 ------------------------ """
def f1():
  i = 0
  while i < 5:
    print(i)
    i += 1
  # 循环正常结束时执行(可选)
  else:
    print("循环正常结束")
# f1()

""" ------------------------ 遍历字符串 ------------------------ """
def f2():
  for i in "hello world":
    print(i)
  else:
    print("循环正常结束")
# f2()

""" ------------------------ range 基础 ------------------------ """
def f3():
  for i in range(5):
    print(i)
  print('------------------------')
  for i in range(1, 5):
    print(i)
  print('------------------------')
  for i in range(1, 5, 2):
    print(i)
f3()