"""拷贝
- 简介
  - 一般用于可变类型(如列表、字典)的拷贝, 因为针对不可变类型(如整数、字符串、元组)的拷贝, 相当于直接赋值。
- 分类
  - 浅拷贝: x = copy.copy(y)
    - 复制对象的引用，而不是对象本身。
    - 改变其中一个对象，另一个对象也会改变。
  - 深拷贝: x = copy.deepcopy(y)
    - 复制对象本身，而不是对象的引用。
    - 改变其中一个对象，另一个对象不会改变。
"""
import copy

""" ------------------------ 普通赋值 ------------------------ """
def f1():
    a = 10
    b = a
    print(id(a))  # 1
    print(id(b))  # 1
    print(id(10))  # 1
# f1()

""" ------------------------ 浅拷贝 ------------------------ """
def f2():
    a = [1, 2, 3, 4, 5]
    b = copy.copy(a)
    print(id(a))  # 1
    print(id(b))  # 2

    c = [1, 2]
    d = [3, 4]
    e = [c, d]
    f = copy.copy(e)
    print(id(e))  # 1
    print(id(f))  # 2
    
    c.append(5)
    print(e)  # [[1, 2, 5], [3, 4]]
    print(f)  # [[1, 2, 5], [3, 4]]
# f2()

""" ------------------------ 深拷贝 ------------------------ """
def f3():
    c = [1, 2]
    d = [3, 4]
    e = [c, d]
    f = copy.deepcopy(e)
    print(id(e))  # 1
    print(id(f))  # 2
    
    c.append(5)
    print(e)  # [[1, 2, 5], [3, 4]]
    print(f)  # [[1, 2], [3, 4]]
f3()
