"""运算符
- 算术运算符
  - 加法: +
  - 减法: -
  - 乘法: *
  - 除法: /
  - 取余: %
  - 取整: //
  - 幂运算: **
  - 算术运算符的优先级
    - 幂运算: **
    - *、/、//、%
    - +、-
- 赋值运算符
  - 简单赋值: =
  - 加法赋值: +=
  - 减法赋值: -=
  - 乘法赋值: *=
  - 除法赋值: /=
  - 取整赋值: //=
  - 取余赋值: %=
  - 幂运算赋值: **=
- 比较运算符
  - 等于: ==
  - 不等于: !=
  - 大于: >
  - 大于等于: >=
  - 小于: <
  - 小于等于: <=
  - 示例
    - 20 <= n <= 30
- 逻辑运算符
  - 与: and
  - 或: or
  - 非: not

"""

""" ------------------------ 基础 ------------------------ """
def f1():
  n1 = 1
  n2 = 2
  print(n1 + n2)
f1()

